Обработки/Reports/_ОтчетПоВероятнымПотерямНациональный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоВероятнымПотерямНациональный</Name>
			<Comment>#671303</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоВероятнымПотерямНациональный/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по вероятным потерям (Национальный)",
		"0.07",
		,
		Истина);
	
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "СформироватьОповещение", "Сформировать оповещение", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

// Интерфейс для запуска формирования отчетов по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(
		ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	Если ИдентификаторКоманды = "СформироватьОповещение" Тогда
		СформироватьОповещение(ИдентификаторКоманды, ПараметрыКоманды);
	Иначе
		ВызватьИсключение СтрШаблон("Неизвестный идентификатор команды '%1'", ИдентификаторКоманды);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	УстановитьПривилегированныйРежим(Истина);	
	
	СтандартнаяОбработка = Ложь;
	
	ТаблицаОтчета = ПолучитьДанныеОтчета();
	
	Если ТаблицаОтчета <> Неопределено Тогда
	
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("_ТаблицаОтчета", ТаблицаОтчета);
		
		ДополнительныеПараметры = Новый Структура("РегистрацияСтатистики", Ложь);
		
		// Выполняем программную компоновку
		РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, , , , ВнешниеНаборыДанных, ДополнительныеПараметры);		
		
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);

КонецПроцедуры

Функция ПолучитьДанныеОтчета()

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Период, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	ТаблицаОтчета = Новый ТаблицаЗначений;
	ТаблицаОтчета.Колонки.Добавить("ЦеннаяБумага");
	ТаблицаОтчета.Колонки.Добавить("Эмитент", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ТаблицаОтчета.Колонки.Добавить("LGD", Новый ОписаниеТипов("Число"));
	ТаблицаОтчета.Колонки.Добавить("PD", Новый ОписаниеТипов("Число"));
	ТаблицаОтчета.Колонки.Добавить("V", Новый ОписаниеТипов("Число"));
	ТаблицаОтчета.Колонки.Добавить("EL", Новый ОписаниеТипов("Число"));
	ТаблицаОтчета.Колонки.Добавить("ПрогнозРейтинга");
	ТаблицаОтчета.Колонки.Добавить("УровеньРейтинга", Новый ОписаниеТипов("Число"));
	ТаблицаОтчета.Колонки.Добавить("ЗначениеРейтинга", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25, ДопустимаяДлина.Переменная)));
	ТаблицаОтчета.Колонки.Добавить("ПринадлежностьРейтинга", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25, ДопустимаяДлина.Переменная)));
	ТаблицаОтчета.Колонки.Добавить("СтрокаСопоставления");
	
	Если НастройкиУчета.ВариантУчетаСтоимостиИОбесцененияФинансовыхАктивов = Перечисления.СтандартыФинансовойОтчетности.МСФО9 Тогда
		
		ДокументНачисленияРезерва = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
		
		ДокументНачисленияРезерва.Дата = ЭтотОбъект.Период;
		ДокументНачисленияРезерва.Организация = ЭтотОбъект.Организация;
		ДокументНачисленияРезерва.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		ДокументНачисленияРезерва.ЦельРасчета = Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении;
		
		Если НастройкиУчета.ВариантРасчетаОжидаемыхКредитныхУбытков = Справочники.ВариантыРасчетаОжидаемыхКредитныхУбытков.Национальный Тогда
			
			Если НачалоДня(ЭтотОбъект.Период) >= Дата(2025, 03, 31) Тогда
				ТаблицаPD = ДокументНачисленияРезерва.ПолучитьТаблицуPD("НациональныйШкалаPD20250331");
			Иначе
				ТаблицаPD = ДокументНачисленияРезерва.ПолучитьТаблицуPD("НациональныйШкалаPD");
			КонецЕсли;
			
			НачислятьРезервНаДЗПоПогашениюКупонаТелаДивидендов	 = Истина;
			Если НачалоДня(ЭтотОбъект.Период) >= '20250506' Тогда
				// Письмо №05-02-03/5@/01590-Исх от 6 мая 2025 г..
				ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии = Истина;
			Иначе 	
				ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии = Ложь;
			КонецЕсли;			
			
		ИначеЕсли НастройкиУчета.ВариантРасчетаОжидаемыхКредитныхУбытков = Справочники.ВариантыРасчетаОжидаемыхКредитныхУбытков.Национальный2025 Тогда
			
			НачислятьРезервНаДЗПоПогашениюКупонаТелаДивидендов	 = Истина;
			
			ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии = Истина;
			
			
			ТаблицаPD = ДокументНачисленияРезерва.ПолучитьТаблицуPD("НациональныйШкалаPD2025", , , Истина);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ '" + ЭтотОбъект.СчетДоверительногоУправления + "' формирование данного отчета не предусмотрено!");
			Возврат Неопределено;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		#Область Запрос
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаPD.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ТаблицаPD.СтрокаРейтинга КАК СтрокаРейтинга,
		|	ТаблицаPD.PD КАК PD,
		|	ТаблицаPD.УровеньРейтинга КАК УровеньРейтинга
		|ПОМЕСТИТЬ _ТаблицаPD
		|ИЗ
		|	&ТаблицаPD КАК ТаблицаPD
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо КАК Эмитент,
		|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета + СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Стоимость
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Активность
		|	И СтоимостьПереоценки.Период = &День
		|	И СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И (ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|					ИЛИ ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Биржи))
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции))
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание
		|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики.Банк.ЮрФизЛицо
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики.БанковскийСчет.Банк.ЮрФизЛицо
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Документ.МНО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики.РасчетныйСчет.Банк.ЮрФизЛицо
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И (ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|					ИЛИ ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.Биржи))
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики.ЮрФизЛицо
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|			ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание.Контрагент
		|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
		|				И (СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюОблигации)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации)
		|					ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНачислениюДивидендовАкции))
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеКупона)
		|						ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание.Облигация.Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|						ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|					КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.НачислениеДивидендов)
		|						ТОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Основание.ЦеннаяБумага.Эмитент.ЮрФизЛицо
		|				КОНЕЦ
		|		ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Контрагент
		|	КОНЕЦ,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &День
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Активность
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	ВЫБОР
		|		КОГДА РейтингиСрезПоследних.ПрогнозРейтинга = ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Негативный)
		|			ТОГДА 0
		|		КОГДА РейтингиСрезПоследних.ПрогнозРейтинга = ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Стабильный)
		|			ТОГДА 2
		|		КОГДА РейтингиСрезПоследних.ПрогнозРейтинга = ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Позитивный)
		|			ТОГДА 3
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК УровеньПрогнозаРейтинга,
		|	ЕСТЬNULL(СопоставлениеРейтинговыхШкалСрезПоследних.СтрокаСопоставления, 5) КАК СтрокаСопоставления,
		|	_ТаблицаPD.PD КАК PD,
		|	_ТаблицаPD.УровеньРейтинга КАК УровеньРейтинга,
		|	_ТаблицаPD.СтрокаРейтинга КАК СтрокаРейтинга
		|ПОМЕСТИТЬ _РейтингиСрезПоследних
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&День,
		|			(Субъект В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.ЦеннаяБумага
		|					ИЗ
		|						_ЦенныеБумаги
		|					ГДЕ
		|						ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Справочник.Облигации))
		|				ИЛИ Субъект В
		|					(ВЫБРАТЬ
		|						ВЫБОР
		|							КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеКупона)
		|								ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.ПогашениеКупона).Облигация
		|							КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|								ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|							КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.НачислениеДивидендов)
		|								ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.НачислениеДивидендов).ЦеннаяБумага
		|						КОНЕЦ
		|					ИЗ
		|						_ЦенныеБумаги
		|					ГДЕ
		|						(ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеКупона)
		|							ИЛИ ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|							ИЛИ ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.НачислениеДивидендов)
		|								И &ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии))
		|				ИЛИ Субъект В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.Эмитент
		|					ИЗ
		|						_ЦенныеБумаги))
		|				И (Шкала.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ Шкала.ДатаПереходаВАрхив > &День)) КАК РейтингиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеРейтинговыхШкал.СрезПоследних(&День, Источник = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.ПереченьЦБ_РФДляОтчетности)) КАК СопоставлениеРейтинговыхШкалСрезПоследних
		|		ПО РейтингиСрезПоследних.Шкала = СопоставлениеРейтинговыхШкалСрезПоследних.ШкалаРейтингаЭталонная
		|			И (РейтингиСрезПоследних.ЗначениеРейтинга.Оценка МЕЖДУ СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМаксимальное.Оценка И СопоставлениеРейтинговыхШкалСрезПоследних.ЗначениеМинимальное.Оценка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаPD КАК _ТаблицаPD
		|		ПО РейтингиСрезПоследних.РейтинговоеАгентство = _ТаблицаPD.РейтинговоеАгентство
		|			И РейтингиСрезПоследних.ЗначениеРейтинга.Наименование = _ТаблицаPD.СтрокаРейтинга
		|ГДЕ
		|	(РейтингиСрезПоследних.ДатаПереходаВАрхив > &День
		|			ИЛИ РейтингиСрезПоследних.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|	И (РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив > &День
		|			ИЛИ РейтингиСрезПоследних.ЗначениеРейтинга.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	МИНИМУМ(РейтингиСрезПоследних.СтрокаСопоставления) КАК СтрокаСопоставления,
		|	МИНИМУМ(РейтингиСрезПоследних.PD) КАК PD,
		|	МИНИМУМ(РейтингиСрезПоследних.УровеньРейтинга) КАК УровеньРейтинга,
		|	МИНИМУМ(РейтингиСрезПоследних.СтрокаРейтинга) КАК СтрокаРейтинга
		|ПОМЕСТИТЬ _ЛучшиеРейтингиБезНаименования
		|ИЗ
		|	_РейтингиСрезПоследних КАК РейтингиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	РейтингиСрезПоследних.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ЛучшиеРейтинги.Субъект КАК Субъект,
		|	_ЛучшиеРейтинги.СтрокаСопоставления КАК СтрокаСопоставления,
		|	_ЛучшиеРейтинги.PD КАК PD,
		|	_ЛучшиеРейтинги.УровеньРейтинга КАК УровеньРейтинга,
		|	МИНИМУМ(_РейтингиСрезПоследних.СтрокаРейтинга) КАК СтрокаРейтинга
		|ПОМЕСТИТЬ _ЛучшиеРейтинги
		|ИЗ
		|	_ЛучшиеРейтингиБезНаименования КАК _ЛучшиеРейтинги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиСрезПоследних КАК _РейтингиСрезПоследних
		|		ПО _ЛучшиеРейтинги.Субъект = _РейтингиСрезПоследних.Субъект
		|			И _ЛучшиеРейтинги.СтрокаСопоставления = _РейтингиСрезПоследних.СтрокаСопоставления
		|			И _ЛучшиеРейтинги.PD = _РейтингиСрезПоследних.PD
		|			И _ЛучшиеРейтинги.УровеньРейтинга = _РейтингиСрезПоследних.УровеньРейтинга
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЛучшиеРейтинги.Субъект,
		|	_ЛучшиеРейтинги.СтрокаСопоставления,
		|	_ЛучшиеРейтинги.PD,
		|	_ЛучшиеРейтинги.УровеньРейтинга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК Субъект,
		|	РейтингиСрезПоследних.СтрокаСопоставления КАК СтрокаСопоставления,
		|	РейтингиСрезПоследних.PD КАК PD,
		|	РейтингиСрезПоследних.УровеньРейтинга КАК УровеньРейтинга,
		|	МАКСИМУМ(РейтингиСрезПоследних.УровеньПрогнозаРейтинга) КАК УровеньПрогнозаРейтинга
		|ПОМЕСТИТЬ _РейтингиСЛучшимПрогнозом
		|ИЗ
		|	_РейтингиСрезПоследних КАК РейтингиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	РейтингиСрезПоследних.Субъект,
		|	РейтингиСрезПоследних.СтрокаСопоставления,
		|	РейтингиСрезПоследних.PD,
		|	РейтингиСрезПоследних.УровеньРейтинга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЛучшиеРейтинги.Субъект КАК Субъект,
		|	ЛучшиеРейтинги.СтрокаСопоставления КАК СтрокаСопоставления,
		|	ЛучшиеРейтинги.PD КАК PD,
		|	ЛучшиеРейтинги.УровеньРейтинга КАК УровеньРейтинга,
		|	ВЫБОР
		|		КОГДА РейтингиСЛучшимПрогнозом.УровеньПрогнозаРейтинга = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Негативный)
		|		КОГДА РейтингиСЛучшимПрогнозом.УровеньПрогнозаРейтинга = 1
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.НеОпределен)
		|		КОГДА РейтингиСЛучшимПрогнозом.УровеньПрогнозаРейтинга = 2
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Стабильный)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.Позитивный)
		|	КОНЕЦ КАК ПрогнозРейтинга,
		|	ЛучшиеРейтинги.СтрокаРейтинга КАК СтрокаРейтинга
		|ПОМЕСТИТЬ _ЛучшиеРейтингиИПрогнозы
		|ИЗ
		|	_ЛучшиеРейтинги КАК ЛучшиеРейтинги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиСЛучшимПрогнозом КАК РейтингиСЛучшимПрогнозом
		|		ПО ЛучшиеРейтинги.Субъект = РейтингиСЛучшимПрогнозом.Субъект
		|			И ЛучшиеРейтинги.СтрокаСопоставления = РейтингиСЛучшимПрогнозом.СтрокаСопоставления
		|			И ЛучшиеРейтинги.PD = РейтингиСЛучшимПрогнозом.PD
		|			И ЛучшиеРейтинги.УровеньРейтинга = РейтингиСЛучшимПрогнозом.УровеньРейтинга
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ЦенныеБумаги.Эмитент КАК Эмитент,
		|	_ЦенныеБумаги.Стоимость КАК Стоимость,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА 99.5
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.PD
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихАктивов.PD
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА _РейтингиСрезПоследнихАктивов.PD
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.PD < _РейтингиСрезПоследнихАктивов.PD
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.PD
		|		ИНАЧЕ _РейтингиСрезПоследнихАктивов.PD
		|	КОНЕЦ КАК PD,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПрогнозыРейтингов.НеОпределен)
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.ПрогнозРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихАктивов.ПрогнозРейтинга
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА _РейтингиСрезПоследнихАктивов.ПрогнозРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.PD < _РейтингиСрезПоследнихАктивов.PD
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.ПрогнозРейтинга
		|		ИНАЧЕ _РейтингиСрезПоследнихАктивов.ПрогнозРейтинга
		|	КОНЕЦ КАК ПрогнозРейтинга,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА 100
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.УровеньРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихАктивов.УровеньРейтинга
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА _РейтингиСрезПоследнихАктивов.УровеньРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.PD < _РейтингиСрезПоследнихАктивов.PD
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.УровеньРейтинга
		|		ИНАЧЕ _РейтингиСрезПоследнихАктивов.УровеньРейтинга
		|	КОНЕЦ КАК УровеньРейтинга,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА ""Не определен""
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.СтрокаРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихАктивов.СтрокаРейтинга
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА _РейтингиСрезПоследнихАктивов.СтрокаРейтинга
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.PD < _РейтингиСрезПоследнихАктивов.PD
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.СтрокаРейтинга
		|		ИНАЧЕ _РейтингиСрезПоследнихАктивов.СтрокаРейтинга
		|	КОНЕЦ КАК ЗначениеРейтинга,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА """"
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА ""Рейтинг эмитента""
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА ""Рейтинг эмиссии""
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА ""Рейтинг эмиссии""
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.PD < _РейтингиСрезПоследнихАктивов.PD
		|			ТОГДА  ""Рейтинг эмитента""
		|		ИНАЧЕ ""Рейтинг эмиссии""
		|	КОНЕЦ КАК ПринадлежностьРейтинга,
		|	ВЫБОР
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|				И _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА 99.5
		|		КОГДА _РейтингиСрезПоследнихАктивов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.СтрокаСопоставления
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.Субъект ЕСТЬ NULL
		|			ТОГДА _РейтингиСрезПоследнихАктивов.СтрокаСопоставления
		|		КОГДА &ПриоритетРейтингаВыпуска
		|			ТОГДА _РейтингиСрезПоследнихАктивов.СтрокаСопоставления
		|		КОГДА _РейтингиСрезПоследнихЭмитентов.СтрокаСопоставления < _РейтингиСрезПоследнихАктивов.СтрокаСопоставления
		|			ТОГДА _РейтингиСрезПоследнихЭмитентов.СтрокаСопоставления
		|		ИНАЧЕ _РейтингиСрезПоследнихАктивов.СтрокаСопоставления
		|	КОНЕЦ КАК СтрокаСопоставления
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЛучшиеРейтингиИПрогнозы КАК _РейтингиСрезПоследнихАктивов
		|		ПО (_ЦенныеБумаги.ЦеннаяБумага = _РейтингиСрезПоследнихАктивов.Субъект
		|				ИЛИ &ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии
		|					И ВЫБОР
		|						КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеКупона)
		|							ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.ПогашениеКупона).Облигация = _РейтингиСрезПоследнихАктивов.Субъект
		|						КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|							ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага = _РейтингиСрезПоследнихАктивов.Субъект
		|						КОГДА ТИПЗНАЧЕНИЯ(_ЦенныеБумаги.ЦеннаяБумага) = ТИП(Документ.НачислениеДивидендов)
		|							ТОГДА ВЫРАЗИТЬ(_ЦенныеБумаги.ЦеннаяБумага КАК Документ.НачислениеДивидендов).ЦеннаяБумага = _РейтингиСрезПоследнихАктивов.Субъект
		|					КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЛучшиеРейтингиИПрогнозы КАК _РейтингиСрезПоследнихЭмитентов
		|		ПО _ЦенныеБумаги.Эмитент = _РейтингиСрезПоследнихЭмитентов.Субъект";
		
		#КонецОбласти
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ТаблицаPD", ТаблицаPD);
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("День", НачалоДня(ЭтотОбъект.Период));
		Запрос.УстановитьПараметр("ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии", ДляДЗПоПогашениюКупонаТелаДивидендовИспользоватьРейтингЭмиссии);
		
		Если ЭтотОбъект.Период < '20230531' Тогда
			Запрос.УстановитьПараметр("ПриоритетРейтингаВыпуска", Ложь);
		Иначе
			Запрос.УстановитьПараметр("ПриоритетРейтингаВыпуска", Истина);
		КонецЕсли;
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		//для  ОФЗ  - PD и LGD соответствуют значениям  для рейтинга "ААА" (первой группы кредитного качества)
		РейтингГосударственныхОблигаций = ТаблицаPD.НайтиСтроки(Новый Структура("РейтинговоеАгентство, СтрокаРейтинга", Справочники.РейтинговыеАгентства.АКРА, "AAA(RU)"));
		
		ПрофсужденияПоPDLGD = ДокументНачисленияРезерва.ПолучитьПрофсужденияПоPDLGD();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаАктивы = ТаблицаОтчета.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаАктивы, ВыборкаДетальныеЗаписи);
			
			СтрокаАктивы.V = ВыборкаДетальныеЗаписи.Стоимость;
						
			ЭтоГосБумага = Ложь;
			Если (ТипЗнч(ВыборкаДетальныеЗаписи.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации")
				Или ТипЗнч(ВыборкаДетальныеЗаписи.ЦеннаяБумага) = Тип("ДокументСсылка.ПогашениеКупона")
				Или ТипЗнч(ВыборкаДетальныеЗаписи.ЦеннаяБумага) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги"))
				И ВыборкаДетальныеЗаписи.Эмитент = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МинфинРоссии") Тогда
				Для Каждого СтрокаРейтингГосударственныхОблигаций Из РейтингГосударственныхОблигаций Цикл
					СтрокаАктивы.PD = СтрокаРейтингГосударственныхОблигаций.PD;
					СтрокаАктивы.ПрогнозРейтинга = Перечисления.ПрогнозыРейтингов.Стабильный;
					СтрокаАктивы.УровеньРейтинга = 1;
					СтрокаАктивы.СтрокаСопоставления = 1;
					СтрокаАктивы.ЗначениеРейтинга = СтрокаРейтингГосударственныхОблигаций.СтрокаРейтинга;
					СтрокаАктивы.ПринадлежностьРейтинга = "Рейтинг эмитента";
					СтрокаАктивы.LGD = СтрокаРейтингГосударственныхОблигаций.LGD / 100;
					ЭтоГосБумага = Истина;
				КонецЦикла;	
			ИначеЕсли ВыборкаДетальныеЗаписи.УровеньРейтинга = 100 И ВыборкаДетальныеЗаписи.СтрокаСопоставления Тогда 
				
				//При отсутствии рейтинга финансового актива/ контрагента вероятность дефолта определяется как средняя вероятность дефолта на горизонте 1 год для Speculative Grade от агентства Moody’s.
				//Приложение А строка 23
				СтрокаАктивы.PD	= 4.08;
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ЦеннаяБумага) = Тип("ДокументСсылка.СделкаРЕПО")
				И ВыборкаДетальныеЗаписи.ЦеннаяБумага.СделкаСЦентральнымКонтрагентом Тогда
				//Для дебиторской задолженности по операциям обратного репо с центральным контрагентом учитывается рейтинг центрального контрагента в лице НКЦ.
				ПараметрыНастройкиДляPDАктиваНаДату = ДокументНачисленияРезерва.ПолучитьНастройкиДляPDАктиваНаДату();
				СтрокаАктивы.PD = ДокументНачисленияРезерва.ПолучитьPDАктиваНаДату(КонецДня(ЭтотОбъект.Период), ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"), ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"), ТаблицаPD, ПараметрыНастройкиДляPDАктиваНаДату);
				СтрокаАктивы.ПрогнозРейтинга = Перечисления.ПрогнозыРейтингов.Стабильный;
				СтрокаАктивы.УровеньРейтинга = 1;
				СтрокаАктивы.СтрокаСопоставления = 1;
				СтрокаАктивы.ЗначениеРейтинга = "AAA(RU)";
				СтрокаАктивы.ПринадлежностьРейтинга = "Рейтинг эмитента";
				
			КонецЕсли;		
			
			Если Не ЭтоГосБумага Тогда
				ПараметрыНастройкиДляPDАктиваНаДату = ДокументНачисленияРезерва.ПолучитьНастройкиДляPDАктиваНаДату();
				ПараметрыНастройкиДляPDАктиваНаДату.ЕстьLGD = Истина;
				
				СтрокаАктивы.LGD = ДокументНачисленияРезерва.ПолучитьPDАктиваНаДату(НачалоДня(ЭтотОбъект.Период), СтрокаАктивы.ЦеннаяБумага, СтрокаАктивы.Эмитент, ТаблицаPD, ПараметрыНастройкиДляPDАктиваНаДату)/100;
				
				Если СтрокаАктивы.УровеньРейтинга = 100 И СтрокаАктивы.СтрокаСопоставления Тогда 
					//При отсутствии рейтинга эмитента/контрагента для контрагентов из группы КБ ожидаемый процент возврата (RR) определяется для категории
					// Speculative Grade от агентства Moody’s			
					СтрокаАктивы.LGD = 0.618;
				КонецЕсли;	
			КонецЕсли;
			
			СтрокаПрофсужденияПоPDLGD = ПрофсужденияПоPDLGD.Найти(СтрокаАктивы.ЦеннаяБумага); // проверим профсуждения
			Если СтрокаПрофсужденияПоPDLGD <> Неопределено Тогда
				Если СтрокаПрофсужденияПоPDLGD.ОценкаКредитногоРискаPD Тогда
					СтрокаАктивы.PD = СтрокаПрофсужденияПоPDLGD.PD;
				КонецЕсли;	
				Если СтрокаПрофсужденияПоPDLGD.ОценкаКредитногоРискаLGD Тогда
					СтрокаАктивы.LGD = СтрокаПрофсужденияПоPDLGD.LGD;
				КонецЕсли;	
				//СтрокаРасчетРезервов.Профсуждение = Истина;
			КонецЕсли;	
			
			СтрокаАктивы.EL = СтрокаАктивы.V * СтрокаАктивы.LGD * Окр(СтрокаАктивы.PD / 100, 15);
			
			// Переведем для кратосы LGD в %%
			СтрокаАктивы.LGD = СтрокаАктивы.LGD * 100;
			
		КонецЦикла;
	
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По счету ДУ '" + ЭтотОбъект.СчетДоверительногоУправления + "' формирование данного отчета не предусмотрено!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаОтчета;

КонецФункции

Процедура СформироватьОповещение(ИдентификаторКоманды, ПараметрыКоманды)

	// Формируем на Т+2 от последнего дня предыдущей рабочей недели и на Т+2 от предыдущего месяца
	ДатаФормирования = НачалоДня(ТекущаяДата());
	
	КонецПредыдущейНедели = НачалоНедели(ДатаФормирования)-1;
	КонецПредыдущегоМесяца = НачалоМесяца(ДатаФормирования)-1;

	Календари = Справочники.Календари;
    Если ДатаФормирования = Календари.ДобавитьКДатеРабочиеДни(Календари.Общероссийский, КонецПредыдущейНедели, 2) Тогда
		ОтчетнаяДата = КонецПредыдущейНедели;
	ИначеЕсли ДатаФормирования = Календари.ДобавитьКДатеРабочиеДни(Календари.Общероссийский, КонецПредыдущегоМесяца, 2) Тогда
		ОтчетнаяДата = КонецПредыдущегоМесяца;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ЭтотОбъект.Организация);
	Отбор.Вставить("Клиент", ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_Национальный"));
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(
		МенеджерВременныхТаблиц, ОтчетнаяДата, Отбор, "_СчетаДУ");
		
	Выборка = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(МенеджерВременныхТаблиц, "_СчетаДУ").Выбрать();
		
	ИтоговаяТаблица = Новый ТаблицаЗначений;
	ИтоговаяТаблица.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(70)));
	ИтоговаяТаблица.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ИтоговаяТаблица.Колонки.Добавить("ЗначениеEL", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,4)));
	ИтоговаяТаблица.Колонки.Добавить("Ограничение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,4)));
	ИтоговаяТаблица.Колонки.Добавить("НаличиеНарушений", Новый ОписаниеТипов("Булево"));
	
	НаличиеНарушений = Ложь;
	
	Пока Выборка.Следующий() Цикл
	
		ЭтотОбъект.СчетДоверительногоУправления = Выборка.Ссылка;
		ЭтотОбъект.Период = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(
			ЭтотОбъект.Организация, 
			Выборка.Ссылка, 
			ОтчетнаяДата);
		
		ТаблицаОтчета = ПолучитьДанныеОтчета();
		
		Если ТаблицаОтчета <> Неопределено Тогда
		
			ДанныеПоСчетуДУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Ссылка, "НомерДоговора, ДатаЗаключения, Наименование");
			
			V = ТаблицаОтчета.Итог("V");
			EL = ТаблицаОтчета.Итог("EL");
			
			НоваяСтрока = ИтоговаяТаблица.Добавить();
			НоваяСтрока.НомерДоговора = ДанныеПоСчетуДУ.НомерДоговора;
			НоваяСтрока.Дата = ОтчетнаяДата;
			НоваяСтрока.ЗначениеEL = ?(V = 0, 0, EL/V*100);
			НоваяСтрока.Ограничение = 1;
			НоваяСтрока.НаличиеНарушений = НоваяСтрока.ЗначениеEL > НоваяСтрока.Ограничение;
			
			Если НоваяСтрока.НаличиеНарушений Тогда
				НаличиеНарушений = Истина;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	ИтоговаяТаблица.Сортировать("НаличиеНарушений Убыв, НомерДоговора");
	
	// Формируем оповещения
	Колонки = Новый Массив;
	Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "НомерДоговора", "Номер договора"));
	Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Дата", "Дата", "ДФ=dd.MM.yyyy"));
	Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "ЗначениеEL", "Значение EL", "ЧЦ=10; ЧДЦ=4"));
	Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "Ограничение", "Ограничение max (%)", "ЧЦ=10; ЧДЦ=4"));
	Колонки.Добавить(Новый Структура("Имя, Заголовок, Формат", "НаличиеНарушений", "Наличие нарушений", "БЛ=Нет; БИ=Да"));
	
	ЭлементыОтчета = Новый Массив;
	ЭлементыОтчета.Добавить(Новый Структура("Тип, Заголовок, Значение, Колонки", 
		"ТаблицаЗначений", 
		"Результат проверки по клиенту НПФ Национальный: " + Формат(НаличиеНарушений, "БЛ='НАРУШЕНИЙ НЕТ'; БИ='НАРУШЕНИЯ ВЫЯВЛЕНЫ'"), 
		ИтоговаяТаблица, 
		Колонки));

	РеквизитыОповещения = Новый Структура;
	РеквизитыОповещения.Вставить("Организация", ПараметрыКоманды.Организация);
	РеквизитыОповещения.Вставить("Текст", РаботаСОтчетами.СформироватьОтчетВHTML(ЭлементыОтчета));
	
	Справочники.Оповещения.СформироватьОповещения(
		"Обработка._ОтчетПоВероятнымПотерямНациональный." + ИдентификаторКоманды, 
		Перечисления.ТипыСобытий.ВнешнийВызов, 
		РеквизитыОповещения);

КонецПроцедуры
